Friends | List of all members
ACAPI::MEP::v1::BranchDefault Class Reference
MEP Element Manager
#include <MEPBranchDefault.hpp>
 Inheritance diagram for ACAPI::MEP::v1::BranchDefault:
 Friends
class  | Branch
Result< BranchDefault >  | CreateBranchDefault (Domain)
Creates a BranchDefault.
 Additional Inherited Members
 Public Member Functions inherited from ACAPI::MEP::v1::ElementDefault
std::optional< double >  | GetInsulationThickness () const
uint32_t  | GetPortCount () const
Result< ConnectorShape >  | GetShapeOfPort (uint32_t portIdx) const
Domain  | GetDomain () const
API_Guid  | GetObjectId () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
void  | RemoveInsulation ()
Removes the insulation.
Result< void >  | SetInsulationThickness (double insulationThickness)
Sets the thickness of insulation on the ElementDefault.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ElementDefault.
 Public Attributes inherited from ACAPI::MEP::v1::ElementDefault
friend  | ElementDefault
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementDefault
ElementDefault (std::shared_ptr< Impl::IElementDefaultImpl > impl)
Modifier (ElementDefault &)
virtual  | ~Modifier ()
Detailed Description
The BranchDefault contains the necessary non-geometric data for creating a Branch element.
Since
Archicad 27
Friends And Related Symbol Documentation
◆ Branch
 friend class Branch
friend
◆ CreateBranchDefault
 Result< BranchDefault > CreateBranchDefault  |  ( |  Domain  |  domain | )
friend
Creates a BranchDefault.
After creating and customizing a BranchDefault, it needs to be set as Archicad's default in order to use it during the upcoming RoutingElement connections.
Parameters
domain | The Domain of the requested BranchDefault.
Returns
If able, returns a copy of Archicad's current Default of the Branch tool for the domain defined by the parameter, otherwise Error